export const passwordWords = [
    // 1- أشياء ومفاهيم يومية
    "مِفْتَاح", "جَرَس", "صُنْدُوق", "سُلَّم", "مِرْآة", "قُفْل", "سَاعَة", "مِظَلَّة", "هَاتِف", "صَوْت",
    "صَمْت", "ضَوْء", "ظِلّ", "مُوسِيقَى", "رَقْص", "ضَحِك", "بُكَاء", "هَدِيَّة", "جَائِزَة", "احْتِفَال",

    // 2- طبيعة وأماكن جغرافية
    "نَهْر", "صَحْرَاء", "وَاحَة", "بُرْكَان", "كَهْف", "شَاطِئ", "جَزِيرَة", "غَابَة", "ثَلْج", "مَطَر",
    "سَحَابَة", "طَرِيق", "جِسْر", "مَزْرَعَة", "قَصْر", "مَكْتَبَة", "مَتْحَف", "سُوق", "مِينَاء", "مَنَارَة",

    // 3- دول ومدن مشهورة
    "بَارِيس", "القَاهِرَة", "طُوكْيُو", "لَنْدَن", "رُومَا", "دُبَيّ", "نِيُويُورْك", "الصِّين", "البَرَازِيل", "اليُونَان",
    "الهِنْد", "كَنَدَا", "إِيطَالْيَا", "مِصْر", "المَغْرِب", "الأُرْدُنّ", "رُوسْيَا", "إِسْبَانْيَا", "تُرْكِيَا", "أَلْمَانْيَا",

    // 4- فنون، أفلام، وشخصيات عامة
    "كَامِيرَا", "تِمْثَال", "لَوْحَة", "مَسْرَحِيَّة", "رِوَايَة", "شِعْر", "إِخْرَاج", "سِينَارْيُو", "نَظَّارَة", "قُبَّعَة",
    "تَارِيخ", "فَلْسَفَة", "اكْتِشَاف", "اخْتِرَاع", "بَطَل", "شِرِّير", "عِمْلَاق", "قَزَم", "سَاحِر", "فَارِس",

    // 5- حيوانات وكائنات حية
    "فِيل", "نَمِر", "دُلْفِين", "بَبْغَاء", "بِطْرِيق", "زَرَافَة", "أَسَد", "أَرْنَب", "سَنْجَاب", "ضِفْدَع",
    "نَحْلَة", "فَرَاشَة", "عَنْكَبُوت", "تِمْسَاح", "ثُعْبَان", "دِينَاصُور", "إِوَزَّة", "بُومَة", "غَزَال", "ذِئْب"
];
export const getRandomWord = (): string => {
  const randomIndex = Math.floor(Math.random() * passwordWords.length);
  return passwordWords[randomIndex];
};
