export const offsideQuestions = [
    // 1- أسئلة جغرافية وتاريخية سريعة
    "اِذْكُرْ أَسْمَاءَ مُدُنٍ مِصْرِيَّةٍ تَقَعُ عَلَى نَهْرِ النِّيلِ.",
    "اِذْكُرْ أَسْمَاءَ دُوَلٍ فِي قَارَّةِ آسْيَا.",
    "اِذْكُرْ أَسْمَاءَ عَوَاصِمَ أُورُوبِيَّةٍ تَبْدَأُ بِحَرْفِ (الْمِيم) أَوِ (اللَّام).",
    "اِذْكُرْ أَسْمَاءَ بَحَارٍ أَوْ مُحِيطَاتٍ غَيْرِ الْمُتَوَسِّطِ وَالْأَحْمَرِ.",
    "اِذْكُرْ أَسْمَاءَ شَخْصِيَّاتٍ تَارِيخِيَّةٍ فَرِيدَةٍ مِنْ الْعَالَمِ الْقَدِيمِ (غَيْرِ فَرَاعِنَة).",
    "اِذْكُرْ أَسْمَاءَ جُزُرٍ مَشْهُورَةٍ فِي الْعَالَمِ.",
    "اِذْكُرْ أَسْمَاءَ عَوَاصِمَ عَرَبِيَّةٍ غَيْرِ الْقَاهِرَةِ وَالرِّيَاضِ وَدُبَيّ.",
    "اِذْكُرْ أَسْمَاءَ دُوَلٍ لَا تَمْتَلِكُ مَنْفَذًا بَحْرِيًّا (مُحَاطَةٌ بِاليَابِسَة).",
    "اِذْكُرْ أَسْمَاءَ مَعَالِمَ سِيَاحِيَّةٍ عَالَمِيَّةٍ مَشْهُورَةٍ.",
    "اِذْكُرْ أَسْمَاءَ قَارَّاتِ الْعَالَمِ وَمُحِيطَاتِهِ.",

    // 2- أسئلة فنية وثقافية سريعة
    "اِذْكُرْ أَسْمَاءَ أَفْلَامٍ مِصْرِيَّةٍ قَدِيمَةٍ بَطَلَهَا (أَحْمَدْ رَمْزِي أَوْ عَبْدِ الْحَلِيمِ حَافِظ).",
    "اِذْكُرْ أَسْمَاءَ مُسَلْسَلَاتٍ مِصْرِيَّةٍ عُرِضَتْ فِي شَهْرِ رَمَضَانَ الْمَاضِي.",
    "اِذْكُرْ أَسْمَاءَ آلاتٍ مُوسِيقِيَّةٍ وَتَرِيَّةٍ.",
    "اِذْكُرْ أَسْمَاءَ كُتَّابٍ وَرِوَائِيِّينَ مِصْرِيِّينَ مَشْهُورِينَ (مِثْلَ نَجِيب مَحْفُوظ).",
    "اِذْكُرْ أَسْمَاءَ شَخْصِيَّاتٍ كَرْتُونِيَّةٍ مِنْ شَرِكَةِ دِيِزْنِي (غَيْرِ الْأَمِيرَات).",
    "اِذْكُرْ أَسْمَاءَ لَاعِبِي كُرَةِ قَدَمٍ عَرَبٍ اِحْتَرَفُوا فِي نَادِي (آرسِنَالْ) الْإِنْجْلِيزِيّ.",
    "اِذْكُرْ أَسْمَاءَ فَنَّانِينَ مِصْرِيِّينَ رَحَلُوا فِي الْعَقْدَيْنِ الْمَاضِيَيْنِ.",
    "اِذْكُرْ أَسْمَاءَ أَفْلَامٍ حَاصِلَةٍ عَلَى جَائِزَةِ الْأُوسْكَارِ (أَفْضَلِ فِيلْم).",
    "اِذْكُرْ أَسْمَاءَ أَكْلَاتٍ شَعْبِيَّةٍ مِصْرِيَّةٍ (مِثْلَ الْكُشَرِيّ).",
    "اِذْكُرْ أَسْمَاءَ أَلْوَانٍ لَا تَدْخُلُ فِي طَيْفِ قَوْسِ قُزَحٍ.",

    // 3- أسئلة معلومات عامة سريعة
    "اِذْكُرْ أَسْمَاءَ كَوَاكِبَ فِي مَجْمُوعَتِنَا الشَّمْسِيَّةِ (غَيْرِ الْأَرْضِ).",
    "اِذْكُرْ أَسْمَاءَ مُخْتَرَعَاتٍ غَيَّرَتْ مَسَارَ التَّارِيخِ.",
    "اِذْكُرْ أَسْمَاءَ زُهُورٍ أَوْ نَبَاتَاتٍ مَشْهُورَةٍ.",
    "اِذْكُرْ أَسْمَاءَ عَمَلَاتٍ عَرَبِيَّةٍ غَيْرِ الْجُنَيْهِ أَوِ الدِّينَارِ.",
    "اِذْكُرْ أَسْمَاءَ حَيَوَانَاتٍ بَرِّيَّةٍ تَعِيشُ فِي الصَّحْرَاءِ.",
    "اِذْكُرْ أَسْمَاءَ فِيتَامِينَاِت (مِثْلَ فِيتَامِين ج).",
    "اِذْكُرْ أَسْمَاءَ عُلَمَاءَ مُسْلِمِينَ مَشْهُورِينَ فِي الْعُصُورِ الْوُسْطَى.",
    "اِذْكُرْ أَسْمَاءَ قَوَانِينٍ أَوْ نَظَرِيَّاتٍ عِلْمِيَّةٍ (مِثْلَ الْجَاذِبِيَّة).",
    "اِذْكُرْ أَسْمَاءَ وَسَائِلِ نَقْلٍ مُخْتَلِفَةٍ (بَرِّيَّةٍ، بَحْرِيَّةٍ، جَوِّيَّةٍ).",
    "اِذْكُرْ أَسْمَاءَ أَجْزَاءٍ أَسَاسِيَّةٍ فِي الْحَاسُوبِ (الْكَمْبِيُوتَر)."
];

export const getRandomOffsideQuestion = (): string => {
    const randomIndex = Math.floor(Math.random() * offsideQuestions.length);
    return offsideQuestions[randomIndex];
};