export const fiveInTenQuestions = [
    // 1- أسئلة سهلة جداً (Easy)
    "اِذْكُر ٥ مِنْ أَسْمَاء الْفَوَاكِه ذَات اللَّوْن الْأَحْمَر.",
    "اِذْكُر ٥ مِنْ الْأَشْيَاء الَّتِي تَجِدُهَا فِي غُرْفَة النَّوْم.",
    "اِذْكُر ٥ مِنْ أَسْمَاء الْمُحِيطَات أَو الْبِحَار الْكُبْرَى.",
    "اِذْكُر ٥ مِنْ أَسْمَاء الْأَلْوَان الْأَسَاسِيَّة أَو الْمَشْهُورَة.",
    "اِذْكُر ٥ مِنْ الْأَفْلَام الْكُومِيدِيَّة الْمِصْرِيَّة الْقَدِيمَة جِدّاً.",
    "اِذْكُر ٥ مِنْ أَسْمَاء الطُّيُور (غَيْر الدَّوَاجِن).",
    "اِذْكُر ٥ مِنْ الْأَشْيَاء الَّتِي تَجِدُهَا عَلَى الْمَائِدَة (طَاوِلَة الْطَّعَام).",
    "اِذْكُر ٥ مِنْ عُطَل الْسَّنَة الرَّسْمِيَّة أَو الْأَعْيَاد الْمُشْهَدَة.",
    "اِذْكُر ٥ مِنْ أَسْمَاء الْأَدَوَات المَدْرَسِيَّة.",
    "اِذْكُر ٥ مِنْ أَسْمَاء الْخَضْرَوَات ذَات اللَّوْن الْأَخْضَر.",
    "اِذْكُر ٥ مِنْ أَسْمَاء الْمُدُن الْمِصْرِيَّة الْبَحْرِيَّة (سَوَاحِل).",
    "اِذْكُر ٥ مِنْ أَسْمَاء الْحَيَوَانَات الْأَلِيفَة.",
    "اِذْكُر ٥ مِنْ أَسْمَاء الشَّخْصِيَّات الْكَرْتُونِيَّة الْمَعْرُوفَة.",
    "اِذْكُر ٥ مِنْ الْمَشْرُوبَات السَّاخِنَة الْمُفَضَّلَة فِي الشِّتَاء.",
    "اِذْكُر ٥ مِنْ أَسْمَاء الْكُتُب الْمُقَدَّسَة أَو السَّمَاوِيَّة (أَو الْأَدْيَان الرَّئِيسِيَّة).",

    // 2- أسئلة متوسطة (Medium)
    "اِذْكُر ٥ مِنْ أَسْمَاء الْعَوَاصِم الْأَفْرِيقِيَّة.",
    "اِذْكُر ٥ مِنْ أَسْمَاء الْمُسَلْسَلَات الْمِصْرِيَّة لـ (يَحْيَى الْفَخْرَانِي).",
    "اِذْكُر ٥ مِنْ أَسْمَاء الْأَنْهَار الطَّوِيلَة فِي الْعَالَم.",
    "اِذْكُر ٥ مِنْ أَسْمَاء الشَّرِكَات الْعَالَمِيَّة الْمُتَخَصِّصَة فِي صِنَاعَة الْهَوَاتِف.",
    "اِذْكُر ٥ مِنْ مُكَوِّنَات صُنْع كَعْكَة الْكِيك.",
    "اِذْكُر ٥ مِنْ أَسْمَاء الْمُغَنِّيَّات (النِّسَاء) الْعَرَبِيَّات الْمَشْهُورَات قَدِيماً.",
    "اِذْكُر ٥ مِنْ أَجْزَاء الْجِسْم الَّتِي يَبْدَأ اِسْمُهَا بِحَرْف الْعَيْن أَو الشِّين.",
    "اِذْكُر ٥ مِنْ أَسْمَاء أَفْلَام (أَحْمَد حِلْمِي) الْمُخْتَلِفَة.",
    "اِذْكُر ٥ مِنْ أَسْمَاء الدُّوَل الَّتِي لَا تَمْتَلِك مَنْفَذًا بَحْرِيًّا.",
    "اِذْكُر ٥ مِنْ أَسْمَاء الْمُدُن الْآسْيَوِيَّة الْكُبْرَى.",
    "اِذْكُر ٥ مِنْ أَسْمَاء الْشَّخْصِيَّات التَّارِيخِيَّة الْمِصْرِيَّة الْقَدِيمَة (غَيْر الْفَرَاعِنَة).",
    "اِذْكُر ٥ مِنْ أَسْمَاء الْأَلْعَاب الْبَرْمَجِيَّة (الفيديو جيمز) الْمَشْهُورَة.",
    "اِذْكُر ٥ مِنْ الْمُخْتَرَعَات أَو الاِكْتِشَافَات الْعِلْمِيَّة الْهَامَّة.",
    "اِذْكُر ٥ مِنْ أَسْمَاء مُسَلْسَلَات (أَمِيرَة الْشَّاشَة) (أَيْ الَّذِي أَدَّت فِيهِ إِحْدَى مُمَثِّلَات الْجِيل الْحَدِيث دَوْر الْبُطُولَة).",
    "اِذْكُر ٥ مِنْ أَسْمَاء الْعَمَلَات الْأَجْنَبِيَّة (غَيْر الْدُّولَار أَو الْيُورُو)."
];

export const getRandomFiveInTenQuestion = (): string => {
    const randomIndex = Math.floor(Math.random() * fiveInTenQuestions.length);
    return fiveInTenQuestions[randomIndex];
};